src/DataProcessors/РаботаСЗадачами/РаботаСЗадачами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСЗадачами</name>
</mdclass:DataProcessor>

src/InformationRegisters/ЗамечанияКоммита/ЗамечанияКоммита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамечанияКоммита</name>
  <resources>
    <name>Замечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСтрокиОбъекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.СтандартыРазработки</types>
    </type>
  </resources>
  <resources>
    <name>ПунктСтандарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникЗамечаний</name>
    <type>
      <types>EnumRef.ИсточникиЗамечаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коммит</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/РаботаСЗадачами/Forms/ФормаЗамечания/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КомментарийОбязателен = Истина;
	
	Если Параметры.Свойство("Задача") И Параметры.Свойство("ИсточникЗамечаний") Тогда
		ЗаполнитьКомментарийПоЗадаче(Параметры.Задача, Параметры.ИсточникЗамечаний);
	КонецЕсли;
	
	Элементы.ФормаПропустить.Видимость = Не КомментарийОбязателен;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если КомментарийОбязателен И Не ЗначениеЗаполнено(Комментарий.ПолучитьТекст()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле комментарий", , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗамечание(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("ДанныеЗамечания", СохранитьЗамечаниеНаСервере()));
	
КонецПроцедуры

&НаСервере
Функция СохранитьЗамечаниеНаСервере()
	
	ТекстHTML = "";
	Вложения = Новый Структура;
	Комментарий.ПолучитьHTML(ТекстHTML, Вложения);
	
	ДанныеЗамечания = Новый Структура;
	ДанныеЗамечания.Вставить("HTML", ТекстHTML);
	ДанныеЗамечания.Вставить("Текст", Комментарий.ПолучитьТекст());
	ДанныеЗамечания.Вставить("хзВложения", Новый ХранилищеЗначения(Вложения, Новый СжатиеДанных(9)));
	Возврат ДанныеЗамечания;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКомментарийПоЗадаче(Задача, ИсточникЗамечаний)

	ЗадачаМетеор = Задачи.ЗадачаИсполнителя.ЗадачаМетеор(Задача);
	
	Замечания = РегистрыСведений.ЗамечанияКоммита.ЗамечанияПоЗадаче(ЗадачаМетеор, ИсточникЗамечаний);
	
	Комментарий.Добавить(Замечания);

КонецПроцедуры
